JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
/*******************************************************************
*ÎÄ¼þÃû³Æ:  usart.c
*ÎÄ¼þ±êÊ¶:
*ÄÚÈÝÕªÒª:
*ÆäËüËµÃ÷:
*µ±Ç°°æ±¾:
*
*ÐÞ¸Ä¼ÇÂ¼1:
*    ÐÞ¸ÄÈÕÆÚ:
*    °æ ±¾ ºÅ:
*    ÐÞ ¸Ä ÈË:
*    ÐÞ¸ÄÄÚÈÝ:
******************************************************************/


/******************************************************************
*                             Í·ÎÄ¼þ                              *
******************************************************************/
#include <string.h>
#include "stm32f30x_usart.h"
#include "stm32f30x_rcc.h"
#include "stm32f30x_dma.h"
#include "stm32f0usart.h"
#include "stm32f0usartopt.h"
#include "stm32f30x_misc.h"
#include "stm32f30x_conf.h"
#include "common.h"
#include "STM32GPIODriver.h"
#include "Ioinit.h"
#include "stm32f30x_flash.h"
#include "HModbusOptimize.h"

#include "MbCommunication.h"
#include "Iocontrol.h"
#include "warn.h"
#include "Mbscrc.h"

/******************************************************************
*                            ³£Á¿                                 *
******************************************************************/

/******************************************************************
*                           ºê¶¨Òå                                *
******************************************************************/

/******************************************************************
*                           Êý¾ÝÀàÐÍ                              *
******************************************************************/

/******************************************************************
*                           È«¾Ö±äÁ¿ÉùÃ÷                          *
******************************************************************/
/* BEGIN: Added by lwe004, 2017/9/27	 PN:°²×°»Øµ÷º¯Êý */
/* USART driver call-back function pointer data */
static STM32F0USARTDriverISRCB pfnIntCbDat[MAX_PORT_NUM];
/* END:   Added by lwe004, 2017/9/27 */

#if STM32F0_UART1_DMA_ENABLE
/*¶¨ÒåUASRT1DMA·¢ËÍ»º´æ*/
uint8_t gucUSART1DMATx[DMA_SEND_BUFSIZE] ={0};   
uint16_t gusUSART1DMATx[DMA_SEND_BUFSIZE] ={0}; 

/*¶¨ÒåUSART1DMA½ÓÊÕ»º´æ*/
uint8_t gucUSART1DMARx[DMA_RECEIVE_BUFSIZE] ={0};
#endif

#if STM32F0_UART2_DMA_ENABLE
/*¶¨ÒåUSART2DMA·¢ËÍ»º´æ*/
uint8_t gucUSART2DMATx[DMA_SEND_BUFSIZE] ={0};   
uint16_t gusUSART2DMATx[DMA_SEND_BUFSIZE] ={0}; 

/*??USART2DMA????*/
uint8_t gucUSART2DMARx[DMA_RECEIVE_BUFSIZE] ={0};
#endif

/*Ö¸Ê¾ÊÇ·ñ½ÓÊÕµ½Ò»¸öÍêÕûµÄModbusÖ¡£¬1Îª½ÓÊÕµ½£¬
    ÔÚ´®¿ÚÖÐ¶ÏRTO·ÖÖ§ÀïÖÃÎ»,0ÎªÎ´ÊÕµ½£¬ÔÚ½ÓÊÕº¯ÊýSTM32F0USARTDriverReceiveÀï¸´Î»*/
uint8_t ucIsReceivedData = STM32F0_USART_RECEIVE_COMPLETE_SWITCH_OFF;

/* BEGIN: Added by zhanghaifeng  we015, 2017/10/12   PN: */
/*ÖÐ¶ÏÏòÁ¿¿ØÖÆÆ÷£¬ÓÃÓÚÊ¹ÄÜ´®¿ÚÖÐ¶ÏºÍDMAÍ¨µÀÖÐ¶Ï*/
NVIC_InitTypeDef NVIC_InitStructure;
/* END:   Added by zhanghaifeng  we015, 2017/10/12 */

/* ´ÓÕ¾Õ¾ºÅ*/
extern uint8_t gucStationNum;

/* IO×´Ì¬»ú */
extern IO_STATE_e geInitState;

#ifdef SCAN_HMODBUS_OPTIMIZE


#if FR4XX4_CODE|| (IO_CODE_TYPE == FR4124_CODE) || (IO_CODE_TYPE == FR4114_CODE)||(IO_CODE_TYPE == FR4104_CODE)
extern int16_t gusaAnalogData[MAX_AO_CHANNEL_NUMBER];
/*¶ÁÈ¡´ÓÕ¾ÒµÎñÊý¾ÝÇëÇóÖ¡(ÎÞ¸æ¾¯)*/
extern uint8_t gucaServiceDataRespFrame[RESPONSE_FRAME_LENGTH]; 
extern uint16_t gusaServiceDataRespFrame[RESPONSE_FRAME_LENGTH+1]; 

/*¶ÁÈ¡´ÓÕ¾ÒµÎñÊý¾ÝÇëÇóÖ¡(ÓÐ¸æ¾¯)*/
extern uint8_t gucaServiceDataRespFrameWarn[RESPONSE_FRAME_LENGTH];
extern uint16_t gusaServiceDataRespFrameWarn[RESPONSE_FRAME_LENGTH+1];

extern uint8_t  gucaUpServiceDataRequFrame[RESPONSE_FRAME_LENGTH];

extern uint8_t gucaUpServiceDataRespFrameMainLoop[UP_RESPONSE_FRAME_LENGTH];
extern uint16_t gusaUpServiceDataRespFrameUSART[UP_RESPONSE_FRAME_LENGTH+1];

extern uint8_t gucAoDataIsChanged;
extern uint8_t gucDisConnectionFlag;
extern uint8_t ucIsDisconnectCheckTimerStart;
extern uint8_t gucaWarnData[MAX_WARN_DATA_NUM/BIT_NUM_PER_BYTE];
extern uint8_t gucDownServDataAnalogUpdateOK;

extern uint8_t gucServDataFraPackageOK;
extern ModuleInfo_t ModuleInfo[4];
extern uint8_t IOLinkEventInfo[16];
#endif
#endif



/******************************************************************
*                         È«¾Öº¯ÊýÉùÃ÷                            *
******************************************************************/
/* BEGIN: Added by lwe004, 2017/9/27   PN:°²×°»Øµ÷º¯Êý */
/*ÉùÃ÷ST ´®¿ÚÇý¶¯»Øµ÷º¯Êý*/
static void STM32F0USART1DriverInstallIntCallBack( Port_Num_e ePortNum, 
                                                      STM32F0USARTDriverISRCB DriverISRCB);
/* END:   Added by lwe004, 2017/9/27 */

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverConfig
*¹¦ÄÜÃèÊö:³õÊ¼»¯º¯Êýµ÷ÓÃµÄÒ»Ð©½á¹¹ÌåÅäÖÃ
*ÊäÈë²ÎÊý:
                            eProtNum   ´®¿ÚºÅ
                            USART_InitStruct   ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            DMA_TXInitStruct   ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            DMA_RXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_TXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_RXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_RTSInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
                            E_STM32F0_USART_DRIVER_OK  ³É¹¦
                            E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR   Èë²Î´íÎó
                            E_STM32F0_USART_DRIVER_INIT_ERR ³õÊ¼»¯Ê§°Ü
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/22                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverConfig(Port_Num_e ePortNum, 
                    USART_InitTypeDef *USART_InitStruct, DMA_InitTypeDef *DMA_RXInitStruct, 
                    DMA_InitTypeDef *DMA_TXInitStruct,GPIO_InitTypeDef *GPIO_TXInitStruct,
                    GPIO_InitTypeDef *GPIO_RTSInitStruct,GPIO_InitTypeDef *GPIO_RXInitStruct)
{
    /*ÅÐ¶ÏUSART_InitStructÊÇ·ñ´íÎó*/
    if (NULL == USART_InitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
