JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
    /*ÅÐ¶ÏDMA_InitStructÊÇ·ñ´íÎó*/
    if (NULL == DMA_TXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
    if (NULL == DMA_RXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
    if (NULL == GPIO_TXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
    if (NULL == GPIO_RXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
    if (NULL == GPIO_RTSInitStruct)
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    
    switch(ePortNum)
    {
    case E_STM32F0_USART_PORT_ONE:
    {
#if STM32F0_UART1_DMA_ENABLE 
        /*GPIOA£¬USART1£¬DMAµÄÊ±ÖÓÅäÖÃ*/
        RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOAEN, ENABLE);
        RCC_APB2PeriphClockCmd(RCC_APB2ENR_USART1EN, ENABLE);
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

        /*¹Ü½Å¸´ÓÃ¹¦ÄÜÅäÖÃ*/
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF_1);
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_1);
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_1);

        /*GPIO½á¹¹ÌåÅäÖÃ*/
        GPIO_TXInitStruct->GPIO_Pin = GPIO_Pin_9;
        
        /*´®¿Ú·¢ËÍÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_TXInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_TXInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_TXInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_TXInitStruct->GPIO_PuPd = GPIO_PuPd_UP;
        
        /*GPIO½á¹¹Ìå½ÓÊläÖÃ*/
        GPIO_RXInitStruct->GPIO_Pin = GPIO_Pin_10;

        /*´®¿Ú½ÓÊÕÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_RXInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_RXInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_RXInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_RXInitStruct->GPIO_PuPd = GPIO_PuPd_UP;

        /*GPIO½á¹¹ÌåRTSÅäÖÃ*/
        GPIO_RTSInitStruct->GPIO_Pin = GPIO_Pin_12;

        /*DEÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_RTSInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_RTSInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_RTSInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_RTSInitStruct->GPIO_PuPd = GPIO_PuPd_NOPULL;     

        /*DMA½á¹¹ÌåÅäÖÃ*/
        DMA_TXInitStruct->DMA_PeripheralBaseAddr = USART1_TDR_ADDRESS;
        DMA_TXInitStruct->DMA_MemoryBaseAddr = (uint32_t)gucUSART1DMATx;
        DMA_TXInitStruct->DMA_DIR = DMA_DIR_PeripheralDST;
        DMA_TXInitStruct->DMA_BufferSize = DMA_SEND_BUFSIZE;
        DMA_TXInitStruct->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_TXInitStruct->DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_TXInitStruct->DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_TXInitStruct->DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_TXInitStruct->DMA_Mode = DMA_Mode_Normal;
        DMA_TXInitStruct->DMA_Priority = DMA_Priority_Low;
        DMA_TXInitStruct->DMA_M2M = DMA_M2M_Disable;
        
        /*DMA½á¹¹ÌåÅäÖÃ*/
        DMA_RXInitStruct->DMA_PeripheralBaseAddr = USART1_RDR_ADDRESS;
        DMA_RXInitStruct->DMA_MemoryBaseAddr = (uint32_t)gucUSART1DMARx;
        DMA_RXInitStruct->DMA_DIR = DMA_DIR_PeripheralSRC;
        DMA_RXInitStruct->DMA_BufferSize = DMA_RECEIVE_BUFSIZE;
        DMA_RXInitStruct->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_RXInitStruct->DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_RXInitStruct->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        DMA_RXInitStruct->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
        DMA_RXInitStruct->DMA_Mode = DMA_Mode_Normal;
        DMA_RXInitStruct->DMA_Priority = DMA_Priority_Low;
        DMA_RXInitStruct->DMA_M2M = DMA_M2M_Disable;
        
        /* Enable the USART IRQ channel */
        NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority= USART_RECEIVE_USART1_PRI;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority  = USART_RECEIVE_USART1_PRI;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&NVIC_InitStructure);

        /*USART½á¹¹ÌåÅäÖÃ*/
        USART_InitStruct->USART_BaudRate = SLAVE_STATION_DEFAULT_COMMCATION_BAUD;
        USART_InitStruct->USART_WordLength = USART_WordLength_9b;
        USART_InitStruct->USART_StopBits = USART_StopBits_1;
        USART_InitStruct->USART_Parity = USART_Parity_No;
        
        /*RTSÓ²¼þÁ÷¿ØÖÆ£¬ÓÃÓÚ¸úLPC1788µÄ°ëË«¹¤´®¿ÚÍ¨Ñ¶*/
        USART_InitStruct->USART_HardwareFlowControl = USART_HardwareFlowControl_None;
        USART_InitStruct->USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
#endif
        break;  
    }
    case E_STM32F0_USART_PORT_TWO:
    {
#if STM32F0_UART2_DMA_ENABLE    
        /*GPIOA,USART2,DMA?????*/
       
        RCC_APB1PeriphClockCmd(RCC_APB1ENR_USART2EN, ENABLE);
        RCC_AHBPeriphClockCmd(RCC_AHBENR_GPIOAEN, ENABLE);
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

        /*????????*/
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_7);
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_7);
        GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_7);

        /*GPIO½á¹¹Ìå·¢ËÍÅäÖÃ*/
        GPIO_TXInitStruct->GPIO_Pin = GPIO_Pin_2;

        /*´®¿Ú·¢ËÍÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_TXInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_TXInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_TXInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_TXInitStruct->GPIO_PuPd = GPIO_PuPd_UP;
        
        /*GPIO½á¹¹Ìå½ÓÊläÖÃ*/
        GPIO_RXInitStruct->GPIO_Pin = GPIO_Pin_3;

        /*´®¿Ú½ÓÊÕÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_RXInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_RXInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_RXInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_RXInitStruct->GPIO_PuPd = GPIO_PuPd_UP;

        /*GPIO½á¹¹ÌåRTSÅäÖÃ*/
        GPIO_RTSInitStruct->GPIO_Pin = GPIO_Pin_1;

        /*DEÊ¹ÓÃ¸´ÓÃÄ£Ê½´«ÊäËÙ¶ÈÉèÖÃÎª¸ßËÙ£¬
                ÍÆÍìÊä³ö*/
        GPIO_RTSInitStruct->GPIO_Mode = GPIO_Mode_AF;
        GPIO_RTSInitStruct->GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_RTSInitStruct->GPIO_OType = GPIO_OType_PP;
        GPIO_RTSInitStruct->GPIO_PuPd = GPIO_PuPd_NOPULL;     

        /*DMA½á¹¹ÌåÅäÖÃ*/
        DMA_TXInitStruct->DMA_PeripheralBaseAddr = USART2_TDR_ADDRESS;
        DMA_TXInitStruct->DMA_MemoryBaseAddr = (uint32_t)gucUSART2DMATx;
        DMA_TXInitStruct->DMA_DIR = DMA_DIR_PeripheralDST;
        DMA_TXInitStruct->DMA_BufferSize = DMA_SEND_BUFSIZE;
        DMA_TXInitStruct->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_TXInitStruct->DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_TXInitStruct->DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_TXInitStruct->DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_TXInitStruct->DMA_Mode = DMA_Mode_Normal;
        DMA_TXInitStruct->DMA_Priority = DMA_Priority_Low;
        DMA_TXInitStruct->DMA_M2M = DMA_M2M_Disable;

        /*DMA½á¹¹ÌåÅäÖÃ*/
        DMA_RXInitStruct->DMA_PeripheralBaseAddr = USART2_RDR_ADDRESS;
        DMA_RXInitStruct->DMA_MemoryBaseAddr = (uint32_t)gucUSART2DMARx;
        DMA_RXInitStruct->DMA_DIR = DMA_DIR_PeripheralSRC;
        DMA_RXInitStruct->DMA_BufferSize = DMA_RECEIVE_BUFSIZE;
        DMA_RXInitStruct->DMA_PeripheralInc = DMA_PeripheralInc_Disable;//----DMA_PeripheralInc_Disable
        DMA_RXInitStruct->DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_RXInitStruct->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        DMA_RXInitStruct->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
        DMA_RXInitStruct->DMA_Mode = DMA_Mode_Normal;
        DMA_RXInitStruct->DMA_Priority = DMA_Priority_Low;
        DMA_RXInitStruct->DMA_M2M = DMA_M2M_Disable;                        
            
             /* Enable the USART IRQ channel */
        NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;   
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority= 1;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority  = 1;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        
        NVIC_Init(&NVIC_InitStructure);           
                /*USART?????*/
        USART_InitStruct->USART_BaudRate = SLAVE_STATION_DEFAULT_COMMCATION_BAUD;
        USART_InitStruct->USART_WordLength = USART_WordLength_9b;
        USART_InitStruct->USART_StopBits = USART_StopBits_1;
        USART_InitStruct->USART_Parity = USART_Parity_No;
        
        /*RTSÓ²¼þÁ÷¿ØÖÆ£¬ÓÃÓÚ¸úLPC1788µÄ°ëË«¹¤´®¿ÚÍ¨Ñ¶*/
        USART_InitStruct->USART_HardwareFlowControl = USART_HardwareFlowControl_None;
        USART_InitStruct->USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
#endif
        break;        
    }
    default:
    {
        return E_STM32F0_USART_DRIVER_CONFIG_PARA_ERR;
    }
    }
    
    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverInit
*¹¦ÄÜÃèÊö:³õÊ¼»¯
*ÊäÈë²ÎÊý:
                            eProtNum   ´®¿ÚºÅ
                            USART_InitStruct   ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            DMA_TXInitStruct   ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            DMA_RXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_TXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_RXInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            GPIO_RTSInitStruct  ST¶¨ÒåµÄ³õÊ¼»¯½á¹¹ÌåÖ¸Õë
                            USARTxDriverCB   »Øµ÷º¯ÊýÖ¸Õë
*Êä³ö²ÎÊý:                          
*·µ»ØÖµ:
                            E_STM32F0_USART_DRIVER_OK  ³É¹¦
                            E_STM32F0_USART_DRIVER_INIT_PARA_ERR   Èë²Î´íÎó
                            E_STM32F0_USART_DRIVER_INIT_ERR ³õÊ¼»¯Ê§°Ü
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/24                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverInit(Port_Num_e ePortNum, 
                    USART_InitTypeDef *USART_InitStruct, DMA_InitTypeDef *DMA_RXInitStruct, 
                    DMA_InitTypeDef *DMA_TXInitStruct,GPIO_InitTypeDef *GPIO_TXInitStruct,
                    GPIO_InitTypeDef *GPIO_RTSInitStruct,GPIO_InitTypeDef *GPIO_RXInitStruct, 
                    STM32F0USARTDriverISRCB USARTxDriverCB)
{
    USART_TypeDef *USARTx = NULL;
    
    assert_param(IS_USART_BAUDRATE(USART_InitStruct->USART_BaudRate));
    
