JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
    /*ÅÐ¶ÏUSART_InitStructÊÇ·ñ´íÎó*/
    if (NULL == USART_InitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    /*Èë²ÎÅÐ¶Ï*/
    if (NULL == DMA_TXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    if (NULL == DMA_RXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    if (NULL == GPIO_TXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    if (NULL == GPIO_RXInitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    if (NULL == GPIO_RTSInitStruct)
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    
    /*ÅÐ¶Ï»Øµ÷º¯ÊýÈë²ÎÊÇ·ñºÏ·¨*/
    if ( NULL == USARTxDriverCB )
    {
      return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }

    if (E_STM32F0_USART_PORT_ONE == ePortNum) 
    {                               
        USARTx = USART1;            
    } 
    else if (E_STM32F0_USART_PORT_TWO == ePortNum)    
    {                           
        USARTx = USART2;       
    }
    else
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }

    /* BEGIN: Added by zhanghaifeng  we015, 2017/1/7   PN: */
    /*ÓÉÓÚ´®¿Ú1Ê¹ÓÃDMAÍ¨µÀ2ºÍ3£¬¶ø(AI)SPIÇý¶¯±ØÐëÊ¹ÓÃDAM
           Í¨µÀ2½ÓÊÕ£¬ËùÒÔÐèÒªÐÞ¸Ä´®¿ÚÇý¶¯Ê¹ÓÃDMAÍ¨µÀ4ºÍ5
           ÊÕ·¢ ¶øÊ¹ÓÃÍ¨µÀ4ºÍ5ÊÕ·¢ÐèÒª¸´ÓÃDMAÍ¨µÀ*/
    //SYSCFG_DeInit();
  //  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
//    SYSCFG_DMAChannelRemapConfig(SYSCFG_CFGR1_USART1RX_DMA_RMP, ENABLE);//-----------
//    SYSCFG_DMAChannelRemapConfig(SYSCFG_CFGR1_USART1TX_DMA_RMP, ENABLE);
    /* END:   Added by zhanghaifeng  we015, 2017/1/7 */
    
    switch(ePortNum)
    {
    case E_STM32F0_USART_PORT_ONE:
    {
        /*GPIOAÄ£¿éºÍRTS³õÊ¼»¯*/        
        GPIO_Init(GPIOA, GPIO_RTSInitStruct);
        GPIO_Init(GPIOA, GPIO_TXInitStruct);
        GPIO_Init(GPIOA, GPIO_RXInitStruct);
        
        /*³õÊ¼»¯DMAÍ¨µÀ£¬Í¨µÀ4ÓÃ×ö·¢ËÍ*/
        DMA_DeInit(DMA1_Channel4);
        DMA_Init(DMA1_Channel4, DMA_TXInitStruct);

        /*³õÊ¼»¯DMAÍ¨µÀ£¬Í¨µÀ5ÓÃ×ö½ÓÊÕ*/
        DMA_DeInit(DMA1_Channel5);
        DMA_Init(DMA1_Channel5, DMA_RXInitStruct);
            
        /*Ê¹ÄÜ´®¿ÚDMA½ÓÊÕºÍ·¢ËÍ*/
        USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);
        USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);
        /*Ê¹ÄÜ´®¿Ú½ÓÊÕÍ¨µÀ£¬Í¨µÀ5ÓÃ×ö½ÓÊÕ*/
        DMA_Cmd(DMA1_Channel5, ENABLE);
        break;
    }
    case E_STM32F0_USART_PORT_TWO:
    {
        /*GPIOAÄ£¿éºÍRTS³õÊ¼»¯*/
        GPIO_Init(GPIOA, GPIO_TXInitStruct);
        GPIO_Init(GPIOA, GPIO_RXInitStruct);
        GPIO_Init(GPIOA, GPIO_RTSInitStruct);

          
        DMA_DeInit(DMA1_Channel7);
        DMA_Init(DMA1_Channel7, DMA_TXInitStruct);
        
         
        DMA_DeInit(DMA1_Channel6);
        DMA_Init(DMA1_Channel6, DMA_RXInitStruct);
             
        USART_DMACmd(USART2, USART_DMAReq_Rx, ENABLE);
        USART_DMACmd(USART2, USART_DMAReq_Tx, ENABLE);
        DMA_Cmd(DMA1_Channel6, ENABLE);
        break;
    }
    default:
    {
        return E_STM32F0_USART_DRIVER_INIT_PARA_ERR;
    }
    }
    
    USART_OverSampling8Cmd(USARTx,ENABLE);   
    /*??USART2???,?????72MHz*/
    RCC_USARTCLKConfig(RCC_USART2CLK_SYSCLK);  
    
   /* ?????*/
    USART_Init(USARTx, USART_InitStruct);
    
    /*9Î»Ä£Ê½*/
    USART_AddressDetectionConfig(USARTx,USART_AddressLength_7b);
    /*ÉèÖÃ´ÓÕ¾µØÖ·*/
    USART_SetAddress(USARTx,gucStationNum);

    USART_MuteModeCmd(USARTx, ENABLE);
    USART_MuteModeWakeUpConfig(USARTx,USART_WakeUp_AddressMark);
    
    /*??DE*/
   // STM32F0USARTEnableDE(USARTx);
    USART_DECmd(USARTx, ENABLE);
    /*??DE????*/
    USART_SetDEAssertionTime(USARTx, USART1_DEAT_VALUE);

    /*³õÊ¼»¯MODBUSÖ§³ÖµÄÌØ¶¨º¯Êý*/
    USART_SetReceiverTimeOut(USARTx, STM32F0_USART_DRIVER_TIMEOUT);
    USART_ReceiverTimeOutCmd(USARTx, ENABLE);
    USART_ITConfig(USARTx, USART_IT_RTO, ENABLE);
    USART_RequestCmd(USARTx, USART_Request_MMRQ, ENABLE);
    /*Ê¹ÄÜ´®¿Ú*/
    USART_Cmd(USARTx, ENABLE);

    /*°²×°´®¿ÚÇý¶¯»Øµ÷º¯Êý*/
    STM32F0USART1DriverInstallIntCallBack(ePortNum, USARTxDriverCB);

    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverSend
*¹¦ÄÜÃèÊö:
*ÊäÈë²ÎÊý:
                             ePortNum  ´®¿ÚºÅ
                             pucSendBuffer   ·¢ËÍ»º´æ£¬ÓÉÒµÎñ·ÖÅä
                             usSendLength   ·¢ËÍ³¤¶È
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
                            E_STM32F0_USART_DRIVER_OK  ³É¹¦
                            E_STM32F0_USART_DRIVER_SEND_PARA_ERR    Èë²Î´íÎó
                            E_STM32F0_USART_DRIVER_SEND_ERR ½ÓÊÕÊ§°Ü
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/25                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverSend(Port_Num_e ePortNum, 
                                                uint8_t *pucSendBuffer, uint16_t usSendLength)
{
    USART_TypeDef *USARTx = NULL;
    STM32F0_USART_DRIVER_ERROR_CODE_e status = E_STM32F0_USART_DRIVER_SEND_ERR;

    /*¶à·¢ËÍÒ»¸ö×Ö½Ú:Ö÷Õ¾Õ¾ºÅ0XFE*/
    usSendLength++;
    /*ÅÐ¶Ï·¢ËÍ»º´æÇøµØÖ·Îª¿Õ*/
    if (NULL == pucSendBuffer)
    {
        return E_STM32F0_USART_DRIVER_SEND_PARA_ERR;
    }
    
    if (E_STM32F0_USART_PORT_ONE == ePortNum) 
    {                               
        USARTx = USART1;            
    }     
    else if (E_STM32F0_USART_PORT_TWO == ePortNum)    
    {                           
        USARTx = USART2;       
    }
    else
    {
        return E_STM32F0_USART_DRIVER_SEND_PARA_ERR;
    }
    
    /*Ê¹ÄÜ´®¿Ú*/
    USART_Cmd(USARTx, ENABLE);
#if STM32F0_UART1_DMA_ENABLE
    /*¹Ø±ÕÍ¨µÀ£¬·¢ËÍÊ¹ÓÃÍ¨µÀ4*/
    DMA_Cmd(DMA1_Channel4, DISABLE);

    /*ÉèÖÃDMA·¢ËÍ»º´æ´óÐ¡*/ 
    DMA_SetCurrDataCounter(DMA1_Channel4, (usSendLength & 0xFFFF));

    /*ÖØÐÂ·¢ËÍbuffer*/
    DMA1_Channel4->CMAR = (uint32_t)gusUSART1DMATx;

    /*¿½±´´ý·¢ËÍÊý¾Ýµ½DMA»º´æ*/
    memcpy(gucUSART1DMATx, pucSendBuffer, usSendLength);

    /*9Î»Ä£Ê½ÏÂ·¢ËÍÊý¾ÝÎª2×Ö½Ú·¢ËÍ*/
    gusUSART1DMATx[0] = 0XFE|0x100;
    for (uint8_t i = 0; i < usSendLength; i++)
    {
        gusUSART1DMATx[i+1] = gucUSART1DMATx[i];
    }
    
    /*´ò¿ª·¢ËÍÖÐ¶Ï*/
    //DMA_ITConfig(DMA1_Channel4, DMA_IT_TC | DMA_IT_TE, ENABLE); 
#endif

#if STM32F0_UART2_DMA_ENABLE
    /*????,??????4*/
    DMA_Cmd(DMA1_Channel7, DISABLE);

    /*??DMA??????*/
    DMA_SetCurrDataCounter(DMA1_Channel7, (usSendLength  & 0xFFFF));

    /*????buffer*/
    DMA1_Channel7->CMAR = (uint32_t)gusUSART2DMATx;
    
    /*????????DMA??*/
    memcpy(gucUSART2DMATx, pucSendBuffer, usSendLength);

        /*9?????????2????*/
    gusUSART2DMATx[0] = 0XFE|0x100;
    for (uint8_t i = 0; i < usSendLength; i++)
    {
        gusUSART2DMATx[i+1] = gucUSART2DMATx[i];
    }
    /*??????*/
   // DMA_ITConfig(DMA1_Channel4, DMA_IT_TC | DMA_IT_TE, ENABLE); 
#endif

    /*´ò¿ªDMA·¢ËÍ*/
    USART_DMACmd(USARTx, USART_DMAReq_Tx, ENABLE);
#if STM32F0_UART1_DMA_ENABLE    
    /* Ê¹ÄÜ DMA Í¨µÀ4*/
    DMA_Cmd(DMA1_Channel4, ENABLE);  
#endif

#if STM32F0_UART2_DMA_ENABLE
    /* ?? DMA ????4*/
    DMA_Cmd(DMA1_Channel7, ENABLE); 
#endif
    status = E_STM32F0_USART_DRIVER_OK;

