JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
    return status;    
}

/******************************************************************
*º¯ÊýÃû³Æ:DMA1_Channel2_3_IRQHandler
*¹¦ÄÜÃèÊö:´¦ÀíDMA·¢ËÍÖÐ¶Ï
*ÊäÈë²ÎÊý:ÎÞ
*Êä³ö²ÎÊý:
*·µ»ØÖµ:ÎÞ
*ÆäËüËµÃ÷:DMAchannel2_3 ÖÐ¶Ï´¦Àí£¬´®¿Ú1Ê¹ÓÃchannel2ºÍ3
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/25                              zhanghaifeng  we015
******************************************************************/
#if STM32F0_UART2_DMA_ENABLE
//void DMA1_Channel2_3_IRQHandler(void)
//{ 
//
//}
void DMA1_Channel6_IRQHandler(void)
{ 
}
void DMA1_Channel7_IRQHandler(void)
{ 
}
#endif

/******************************************************************
*º¯ÊýÃû³Æ:DMA1_Channel4_5_IRQHandler
*¹¦ÄÜÃèÊö:´¦ÀíDMA·¢ËÍÖÐ¶Ï
*ÊäÈë²ÎÊý:ÎÞ
*Êä³ö²ÎÊý:
*·µ»ØÖµ:ÎÞ
*ÆäËüËµÃ÷:DMAchannel4_4 ÖÐ¶Ï´¦Àí£¬´®¿Ú1Ê¹ÓÃchannel4ºÍ5
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/25                              zhanghaifeng  we015
******************************************************************/
#if STM32F0_UART1_DMA_ENABLE
void DMA1_Channel4_5_IRQHandler(void)
{ 
}
#endif

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0UDMASendComplete
*¹¦ÄÜÃèÊö:DMA·¢ËÍÍê³Éºó´ò¿ªDMA½ÓÊÕ¹¦ÄÜ
*ÊäÈë²ÎÊý:ePortNum  ´®¿ÚºÅ
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
E_STM32F0_USART_DRIVER_OK    ³É¹¦DMAÒÑ½«Êý¾Ý·¢ËÍÍê±Ï£¬²¢¿ªÊ¼´ò¿ª½ÓÊÕÄ£Ê½
E_STM32F0_USART_DRIVER_SEND_COMPLETE_PARA_ERR    Èë²Î´íÎó
E_STM32F0_USART_DRIVER_SEND_COMPLETE_ERR ·¢ËÍÍê³ÉÊ§°Ü£¬´®¿Ú»¹Î´Íê³É·¢ËÍ
*ÆäËüËµÃ÷:¸Ãº¯ÊýÐèÒªÖ÷º¯ÊýÖ÷¶¯µ÷ÓÃ£¬Ö÷ÒªÊÇÎªÁË´ò¿ª½ÓÊÕÍ¨µÀ
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/25                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0UDMASendComplete(Port_Num_e ePortNum)
{ 
    USART_TypeDef *USARTx = NULL;
   
    if (E_STM32F0_USART_PORT_ONE == ePortNum) 
    {                               
        USARTx = USART1;            
    } 
    else if (E_STM32F0_USART_PORT_TWO == ePortNum)    
    {                           
        USARTx = USART2;       
    }
    else
    {
         return E_STM32F0_USART_DRIVER_SEND_COMPLETE_PARA_ERR;
    }
    
#if STM32F0_UART1_DMA_ENABLE      
    /*ÉèÖÃDMA½ÓÊÕ»º´æ*/
    DMA_Cmd(DMA1_Channel5, DISABLE);
    /*¸øCNDTR¼Ä´æÆ÷¸³Öµ*/
    DMA_SetCurrDataCounter(DMA1_Channel5, DMA_RECEIVE_BUFSIZE); 
    //DMA1_Channel5->CMAR = (uint32_t)gucUSART1DMARx;
    DMA_Cmd(DMA1_Channel5, ENABLE);
#endif

#if STM32F0_UART2_DMA_ENABLE   
    /*??DMA????*/
    DMA_Cmd(DMA1_Channel6, DISABLE);

    /*?CNDTR?????*/
    DMA_SetCurrDataCounter(DMA1_Channel6, DMA_RECEIVE_BUFSIZE); 
    //DMA1_Channel5->CMAR = (uint32_t)gucUSART2DMARx;
    DMA_Cmd(DMA1_Channel6, ENABLE);
#endif

#if STM32F0_UART1_DMA_ENABLE  
    /*Ê¹ÄÜ´®¿Ú½ÓÊÕÍ¨µÀ*/
    DMA_Cmd(DMA1_Channel5, ENABLE);
#endif

#if STM32F0_UART2_DMA_ENABLE  
    /*????????*/
    DMA_Cmd(DMA1_Channel6, ENABLE);
#endif
    /*Ê¹ÄÜ´®¿Ú*/
    USART_Cmd(USARTx, ENABLE);

    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverReceive
*¹¦ÄÜÃèÊö:½ÓÊÕ´®¿ÚÊý¾Ýµ½ÉÏ²ã
*ÊäÈë²ÎÊý:
         ePortNum  ´®¿ÚºÅ
         pucReceiveBuffer   ½ÓÊÕ»º´æ£¬ÓÉÒµÎñ·ÖÅä
         pusReceiveLength   ½ÓÊÕ³¤¶ÈÖ¸Õë
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
            E_STM32F0_USART_DRIVER_OK  ³É¹¦
            E_STM32F0_USART_DRIVER_RECEIVE_PARA_ERR ²ÎÊý´íÎó
            E_STM32F0_USART_DRIVER_RECEIVE_ERR ½ÓÊÕÊ§°Ü

*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/26                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverReceive(Port_Num_e ePortNum, 
                                        uint8_t *pucReceiveBuffer, uint16_t *pusReceiveLength)
{
    uint16_t NunmberCndtr = 0;
    
    /*ÅÐ¶ÏePortNumÊÇ·ñ´íÎó*/
    if (ePortNum > E_STM32F0_USART_PORT_TWO)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_PARA_ERR;
    } 
    
    /*ÅÐ¶Ï·¢ËÍ»º´æÇøµØÖ·Îª¿Õ*/
    if (NULL == pucReceiveBuffer)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_PARA_ERR;
    }
    
    /*ÅÐ¶Ï½ÓÊÕÊý¾Ý³¤¶ÈÊÇ·ñÎª¿Õ*/
    if (NULL == pusReceiveLength)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_PARA_ERR;
    }
    
    /*ÅÐ¶ÏÈ«¾Ö±äÁ¿ucIsReceivedDataÊÇ·ñ±»ÖÃÎ»(ÖÃÎ»Ôò½øÐÐÏÂÃæÊý¾Ý½ÓÊÕ)*/
    if (STM32F0_USART_RECEIVE_COMPLETE_SWITCH_OFF == ucIsReceivedData)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_ERR;
    }
    
#if STM32F0_UART1_DMA_ENABLE
    /*»ñÈ¡£Ä£Í£Á½ÓÊÕ×Ö½Ú*/
    NunmberCndtr = DMA_GetCurrDataCounter(DMA1_Channel5);
    *pusReceiveLength = DMA_RECEIVE_BUFSIZE - NunmberCndtr;

    /*¿½±´Êý¾Ýµ½pucReceiveBuffer*/
    memcpy(pucReceiveBuffer, gucUSART1DMARx, *pusReceiveLength);
#endif

#if STM32F0_UART2_DMA_ENABLE
    /*??DMA????*/
    NunmberCndtr = DMA_GetCurrDataCounter(DMA1_Channel6);
    *pusReceiveLength = DMA_RECEIVE_BUFSIZE - NunmberCndtr;

    /*¿½±´Êý¾Ýµ½pucReceiveBuffer*/
    memcpy(pucReceiveBuffer, gucUSART2DMARx, *pusReceiveLength);
#endif    
    /*ÖÃÎ»Ê¹ucIsReceivedDataÎª0*/
//    ucIsReceivedData = STM32F0_USART_RECEIVE_COMPLETE_SWITCH_OFF;

    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverReceivePointer
*¹¦ÄÜÃèÊö:½ÓÊÕ´®¿ÚÊý¾Ýµ½ÉÏ²ã
*ÊäÈë²ÎÊý:
                            ePortNum  ´®¿ÚºÅ
                            pucReceiveBuffer   ½ÓÊÕ»º´æÖ¸Õë
                            pusReceiveLength   ½ÓÊÕ³¤¶ÈÖ¸Õë
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
                            E_STM32F0_USART_DRIVER_OK  ³É¹¦
                            E_STM32F0_USART_DRIVER_RECEIVE_POINTER_PARA_ERR ²ÎÊý´íÎó
                            E_STM32F0_USART_DRIVER_RECEIVE_POINTER_ERR ½ÓÊÕÖ¸ÕëÊ§°Ü
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/26                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverReceivePointer(Port_Num_e ePortNum, 
                                        uint8_t **pucReceiveBuffer, uint16_t *pusReceiveLength)
{
    uint16_t NunmberCndtr = 0;   

    /*ÅÐ¶Ï½ÓÊÕ»º´æÇøµØÖ·Îª¿Õ*/
    if (NULL == pucReceiveBuffer)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_POINTER_PARA_ERR;
    }

    /*ÅÐ¶Ï½ÓÊÕÊý¾Ý³¤¶ÈÊÇ·ñÎª¿Õ*/
    if (NULL == pusReceiveLength)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_POINTER_PARA_ERR;
    }
    
    /*ÅÐ¶ÏePortNumÊÇ·ñ´íÎó*/
    if (ePortNum > E_STM32F0_USART_PORT_TWO)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_POINTER_PARA_ERR;
    }  
    
    /*ÅÐ¶ÏÈ«¾Ö±äÁ¿ucIsReceivedDataÊÇ·ñ±»ÖÃÎ»(ÖÃÎ»Ôò½øÐÐÏÂÃæÊý¾Ý½ÓÊÕ)*/    
    if (STM32F0_USART_RECEIVE_COMPLETE_SWITCH_OFF == ucIsReceivedData)
    {
        return E_STM32F0_USART_DRIVER_RECEIVE_POINTER_ERR;
    }
    
#if STM32F0_UART1_DMA_ENABLE 
    /*»ñÈ¡£Ä£Í£Á½ÓÊÕ×Ö½Ú*/
    NunmberCndtr = DMA_GetCurrDataCounter(DMA1_Channel5);
    *pusReceiveLength = DMA_RECEIVE_BUFSIZE - NunmberCndtr;

    /*Ö¸Õë¸³¸øpucReceiveBuffer*/
    *pucReceiveBuffer = gucUSART1DMARx;
#endif

#if STM32F0_UART2_DMA_ENABLE  
    /*??DMA????*/
    NunmberCndtr = DMA_GetCurrDataCounter(DMA1_Channel6);
    *pusReceiveLength = DMA_RECEIVE_BUFSIZE - NunmberCndtr;

    /*Ö¸Õë¸³¸øpucReceiveBuffer*/
    *pucReceiveBuffer = gucUSART2DMARx;
#endif

    /*ÖÃÎ»Ê¹ucIsReceivedDataÎª0*/
    //ucIsReceivedData = STM32F0_USART_RECEIVE_COMPLETE_SWITCH_OFF;

    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTDriverClose
*¹¦ÄÜÃèÊö:¹Ø±ÕÖ¸¶¨´®¿Ú
*ÊäÈë²ÎÊý:ePortNum  ´®¿ÚºÅ
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
                            E_STM32F0_USART_DRIVER_OK  ³É¹¦
                            E_STM32F0_USART_DRIVER_CLOSE_PARA_ERR ²ÎÊý´íÎó
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/26                              zhanghaifeng  we015
******************************************************************/
STM32F0_USART_DRIVER_ERROR_CODE_e STM32F0USARTDriverClose(Port_Num_e ePortNum)
{ 
    USART_TypeDef *USARTx = NULL;
    
    if (E_STM32F0_USART_PORT_ONE == ePortNum) 
    {                               
        USARTx = USART1;            
    }     
    else if (E_STM32F0_USART_PORT_TWO == ePortNum)    
    {                           
        USARTx = USART2;       
    }
    else
    {
         return E_STM32F0_USART_DRIVER_CLOSE_PARA_ERR;
    }   
    
