JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
    /*¹Ø±Õ´®¿Ú*/
    USART_Cmd(USARTx, DISABLE); 
    
    return E_STM32F0_USART_DRIVER_OK;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USART1DriverISR
*¹¦ÄÜÃèÊö:´¦Àí´®¿ÚÖÐ¶Ï
*ÊäÈë²ÎÊý:ÎÞ
*Êä³ö²ÎÊý:
*·µ»ØÖµ:ÎÞ
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/26                              zhanghaifeng  we015
******************************************************************/
extern uint8_t indicatorFlashState [5];
void USART2_IRQHandler(void)
{
      uint16_t usSendCrc16Value = 0;
    
#ifdef SCAN_HMODBUS_OPTIMIZE
#if FR4XX4_CODE|| (IO_CODE_TYPE == FR4124_CODE) || (IO_CODE_TYPE == FR4114_CODE)||(IO_CODE_TYPE == FR4104_CODE)
    uint8_t ucCountInd;
    uint16_t usTemp;/*AO´óÐ¡¶Ë×ª»»ÁÙÊ±Êý¾Ý*/
#endif
#endif
    if ( (SET == USART_GetITStatus(USART2, USART_IT_RTO)))
    {
        /*???????????*/
        if (DMA_RECEIVE_BUFSIZE == DMA1_Channel6->CNDTR)
        {
            /*  ????????*/
            USART2->ICR = USART_FLAG_RTO;
            return;
        }
         
         DMA1_Channel6->CCR &= DMA_CCR_DISEN;
        USART2->CR1 &= USART_CR1_DISUE;
        USART2->ICR = USART_FLAG_RTO;
        
//        /*??????*/        
//        DMA_Cmd(DMA1_Channel6, DISABLE);
//        USART_Cmd(USART2, DISABLE);
//        /*  ????????*/
//        USART_ClearFlag(USART2, USART_FLAG_RTO);

        /* ?????????????????,???? */
        if ((gucStationNum != gucUSART2DMARx[0])
            && (SLAVE_9_MODE_ADDR != gucUSART2DMARx[0]))
        {
            (void)STM32F0UDMASendComplete(E_STM32F0_USART_PORT_TWO);
           // DMA_Cmd(DMA1_Channel6, ENABLE);
           // USART_Cmd(USART2, ENABLE);
            return;
        }

        /* ???????????? */
        if (SLAVE_9_MODE_ADDR == gucUSART2DMARx[0])
        {
            if (IO_STATE_INITIALIZED == geInitState)
            {
                (void)STM32F0UDMASendComplete(E_STM32F0_USART_PORT_TWO);
                /* ?????????,??? */    
                if (gucStationNum != gucUSART2DMARx[2])
                {
                    return;
                }
                /*????,??????4*/
                DMA_Cmd(DMA1_Channel7, DISABLE);
                /*???DMA??*/
                DMA1_Channel7->CMAR=(uint32_t)gusUSART2DMATx;
                /*  ???????,???????????,???????? */
                uint8_t  ucSendBuffer[BUFFER_LEN];
                memset(ucSendBuffer, 0, sizeof(ucSendBuffer));
                (void)PacketAndSendResponse(ucSendBuffer,HANDLE_SUCCESS);

                return;
            }
        }
        /*H-ModbusÒµÎñÊý¾ÝÏìÓ¦Ö¡ÓÅ»¯*/
#ifdef SCAN_HMODBUS_OPTIMIZE

         /*ÉÏÐÐÒµÎñÊý¾Ý´¦Àí*/
        if( gucUSART2DMARx[1] == gucaUpServiceDataRequFrame[1] /*¹¦ÄÜÂë¼ìÑé*/
            && (*((uint16_t *)(gucUSART2DMARx+2))) == (*((uint16_t *)(gucaUpServiceDataRequFrame+2))))
        {
            /*ÏòÖ÷Õ¾·¢ËÍÔ¤ÏÈ×é×°ºÃµÄÏìÓ¦Ö¡*/
            /*ÉèÖÃDMA½ÓÊÕbuffer´óÐ¡*/
            DMA1_Channel6->CCR &= DMA_CCR_DISEN;
            DMA1_Channel6->CNDTR = DMA_RECEIVE_BUFSIZE;
            DMA1_Channel6->CCR |= DMA_CCR_EN;
            /*Ê¹ÄÜ´®¿Ú*/
            USART2->CR1 |= USART_CR1_UE;
            /*disable DMA*/
            DMA1_Channel7->CCR &= DMA_CCR_DISEN;
            /*ÒµÎñÊý¾ÝÏìÓ¦Ö¡(Ö÷Ñ­»·)×é×°Íê³É,½«ÆäÄÚÈÝ¿½±´ÖÁÏìÓ¦Ö¡(ÖÐ¶Ï)*/
                //memcpy(gusaUpServiceDataRespFrameUSART,gusaUpServiceDataRespFrameMainLoop,(UP_RESPONSE_FRAME_LENGTH+1)*2);
                gucaUpServiceDataRespFrameMainLoop[3] = IOLinkEventInfo[0];
                gucaUpServiceDataRespFrameMainLoop[4] = IOLinkEventInfo[1];
                gucaUpServiceDataRespFrameMainLoop[5] = IOLinkEventInfo[2];
                gucaUpServiceDataRespFrameMainLoop[6] = IOLinkEventInfo[3];
                
//                printf("gucaUpServiceDataRespFrameMainLoop[3] = %d\n", gucaUpServiceDataRespFrameMainLoop[3]);
//                printf("gucaUpServiceDataRespFrameMainLoop[4] = %d\n", gucaUpServiceDataRespFrameMainLoop[4]);
//                printf("gucaUpServiceDataRespFrameMainLoop[5] = %d\n", gucaUpServiceDataRespFrameMainLoop[5]);
//                printf("gucaUpServiceDataRespFrameMainLoop[6] = %d\n", gucaUpServiceDataRespFrameMainLoop[6]);
   
                swapEndian(gucaUpServiceDataRespFrameMainLoop+3, IO_LINK_UP_BYTE_COUNT);
              
                /*¼ÆËãCRCÐ£Ñé*/
                usSendCrc16Value = usMBSCRC16(( const uint8_t * )gucaUpServiceDataRespFrameMainLoop,UP_RESPONSE_FRAME_LENGTH - CRC16_VALUE_LENGTH);
                memcpy(gucaUpServiceDataRespFrameMainLoop+3+IO_LINK_UP_BYTE_COUNT,&usSendCrc16Value,CRC16_VALUE_LENGTH);
                
                gusaUpServiceDataRespFrameUSART[0] = 0XFE|0x100;
                for (uint8_t i = 0; i < UP_RESPONSE_FRAME_LENGTH; i++)
                {
                  gusaUpServiceDataRespFrameUSART[i+1] = gucaUpServiceDataRespFrameMainLoop[i];
                }

   
            gucServDataFraPackageOK = E_DATA_SYNC_STATUS_HOLD;
            
            /*ÉèÖÃDMA ·¢ËÍbuffer*/
            /*ÒµÎñÊý¾ÝÏìÓ¦Ö¡(Ö÷Ñ­»·)Î´×é×°Íê³É*/
            DMA1_Channel7->CMAR=(uint32_t)gusaUpServiceDataRespFrameUSART;
            /*ÉèÖÃDMA·¢ËÍ»º´æ´óÐ¡*/ 
            DMA1_Channel7->CNDTR = UP_RESPONSE_FRAME_LENGTH+1;
            DMA_ClearFlag(DMA1_FLAG_GL6);
            
            DMA_ClearFlag(DMA1_FLAG_GL7);
            /* ¨º1?¨¹ DMA ¨ª¡§¦Ì¨¤4*/
            DMA1_Channel7->CCR |= DMA_CCR_EN;
        }       
        /*ÏÂÐÐÒµÎñÊý¾Ý´¦Àí*/
        else if(MODBUS_OPTIMIZE_CRC16_NOERR ==  usMBSCRC16(( const uint8_t * )gucUSART2DMARx,REQUEST_FRAME_LENGTH)/*CRC¼ìÑé*/
            && WRITE_COIL_FUNC_CODE == gucUSART2DMARx[1]    /*¹¦ÄÜÂë¼ìÑé*/
            && COIL_START_ADDRESS == *((uint16_t *)(gucUSART2DMARx+2))) /*ÆðÊ¼µØÖ·¸ß×Ö½Ú¼ìÑé*/
        {
            /*ÏòÖ÷Õ¾·¢ËÍÔ¤ÏÈ×é×°ºÃµÄÏìÓ¦Ö¡*/
            /*ÉèÖÃDMA½ÓÊÕbuffer´óÐ¡*/
            DMA1_Channel6->CCR &= DMA_CCR_DISEN;
            DMA1_Channel6->CNDTR = DMA_RECEIVE_BUFSIZE;
            DMA1_Channel6->CCR |= DMA_CCR_EN;
            /*????*/
            USART2->CR1 |= USART_CR1_UE;
            /*disable DMA*/
            DMA1_Channel7->CCR &= DMA_CCR_DISEN;
            /*ÅÐ¶ÏÊÇ·ñ´æÔÚ¸æ¾¯*/
            if(IO_NO_WARN != gucaWarnData[0])
            {
                /*ÓÐ¸æ¾¯£¬ÉèÖÃDMA ·¢ËÍbuffer*/
                DMA1_Channel7->CMAR=(uint32_t)gusaServiceDataRespFrameWarn;
            }
            else
            {
                /*ÎÞ¸æ¾¯£¬ÉèÖÃDMA ·¢ËÍbuffer*/
                DMA1_Channel7->CMAR=(uint32_t)gusaServiceDataRespFrame;  
            }
            /*ÉèÖÃDMA·¢ËÍ»º´æ´óÐ¡*/
            DMA1_Channel7->CNDTR = RESPONSE_FRAME_LENGTH+1;
            /* Ê¹ÄÜ DMA Í¨µÀ4*/
            DMA1_Channel7->CCR |= DMA_CCR_EN;
            if (E_DATA_SYNC_STATUS_MAINLOOP_HANDLING !=gucDownServDataAnalogUpdateOK)
            {
                memcpy(gusaAnalogData,gucUSART2DMARx+7,AO_DATA_BYTE_COUNT);
                    /*´óÐ¡¶Ë×ª»»*/
                for(ucCountInd = 0; ucCountInd < CHANNEL_COUNT; ++ucCountInd )
                {
                    usTemp = gusaAnalogData[ucCountInd];
                    *((int8_t *)gusaAnalogData +ucCountInd*2) = (uint8_t)(usTemp >> 8);
                    *((int8_t *)gusaAnalogData +ucCountInd*2 + 1) = (uint8_t)(usTemp & 0x00FF);
                }
                
