JacksonOvO/Software_VX_4208/Drivers/src/STM32F0usart.c
//                for (uint8_t i = 0; i < 8; i++)
//                {
//                    printf("gusaAnalogData[%d] = %d\r\n", i, gusaAnalogData[i]);
//                }
                
                //printf("Signal = 0x%04X\n", gusaAnalogData[4]);
                
                /* ¸ü¸ÄAOÊý¾ÝË¢ÐÂ±êÖ¾ */
                gucAoDataIsChanged = AO_DATA_CHANGED;
                /*ÖÃÎª¸üÐÂÌ¬*/
                gucDownServDataAnalogUpdateOK = E_DATA_SYNC_STATUS_UPDATED;
            }
            
            gucDisConnectionFlag = 0;
            /*ÆôÓÃAOÓëÍø¹Ø¶ÏÁ¬µÄ¶¨Ê±Æ÷*/
            if (0  == ucIsDisconnectCheckTimerStart)
            {
                TIM_Cmd( TIM3, ENABLE );
                ucIsDisconnectCheckTimerStart = TIMER_ON;
            }
            /*ÖØÖÃ¶¨Ê±Æ÷*/
            TIM_SetCounter(TIM3, 0);
                    if (indicatorFlashState[4] == 0)
            {
               GPIO_SetBits(GPIOA,GPIO_Pin_0);
            }
        }

        else
        {
          
            DMA_Cmd(DMA1_Channel7, DISABLE);          
            DMA1_Channel7->CMAR=(uint32_t)gusUSART2DMATx;          
            ucIsReceivedData = STM32F0_USART_RECEIVE_COMPLETE_SWITCH_ON;           
            pfnIntCbDat [E_STM32F0_USART_PORT_TWO] (E_STM32F0_USART_PORT_TWO);
        }
#else 
        /*ÖÃ´®¿Ú½ÓÊÕ±êÖ¾´ò¿ª*/
        ucIsReceivedData = STM32F0_USART_RECEIVE_COMPLETE_SWITCH_ON;
        /*µ÷ÓÃ»Øµ÷º¯Êý*/
        pfnIntCbDat [E_STM32F0_USART_PORT_ONE] (E_STM32F0_USART_PORT_ONE);
#endif
    }
    if ( USART_GetITStatus(USART2, USART_IT_ORE))
    {
        /*Ìí¼ÓÒì³£´¦Àí*/
    }
    if ( USART_GetITStatus(USART2, USART_IT_PE))
    {
        /*Ìí¼ÓÒì³£´¦Àí*/
    }
    if(USART_GetITStatus(USART2, USART_IT_ERR))
    {
        USART_ClearFlag(USART2, USART_IT_ERR);     
    }   
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USART1DriverInstallIntCallBack
*¹¦ÄÜÃèÊö:°²×°ST ´®¿ÚÇý¶¯»Øµ÷º¯Êý
*ÊäÈë²ÎÊý:
                            ePortNum    ´®¿ÚºÅ
                            DriverISRCB »Øµ÷º¯ÊýÖ¸Õë
*Êä³ö²ÎÊý:ÎÞ
*·µ»ØÖµ:ÎÞ
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/27                              lwe004
******************************************************************/
static void STM32F0USART1DriverInstallIntCallBack(Port_Num_e ePortNum, 
                                                      STM32F0USARTDriverISRCB DriverISRCB)
{
    /*°²×°»Øµ÷º¯Êý*/
    pfnIntCbDat[ePortNum] = DriverISRCB;
}

/******************************************************************
*º¯ÊýÃû³Æ:STM32F0USARTEnableDE
*¹¦ÄÜÃèÊö:Ê¹ÄÜDEÎ»£¬Ä¿µÄÎªÁËÊ¹RTSÁ÷¹¤×÷
*ÊäÈë²ÎÊý:USARTx     ´®¿Ú
*Êä³ö²ÎÊý:ÎÞ
*·µ»ØÖµ:ÎÞ
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/11/7                              zhanghaifeng  we015
******************************************************************/
void STM32F0USARTEnableDE (USART_TypeDef *USARTx)
{    
    /*Ê¹ÄÜDE*/
    USARTx->CR3 |= 0x4000;
}

/******************************************************************
*º¯ÊýÃû³Æ:
*¹¦ÄÜÃèÊö:
*ÊäÈë²ÎÊý:
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/4                              we004 we014
******************************************************************/
void STM32F0TempIAPEarse(void)
{
    uint8_t i = 0;
    asm ("CPSID   I");

    FLASH_Unlock();
    for(i=0;i<8;i++)
    {
        FLASH_ErasePage(0x0800E000 + i * 1024);
    }
    FLASH_Lock();
    FLASH->SR |= 0x20;
   /* ´ò¿ªÖÐ¶Ï */
    asm ("CPSIE   I");
}

/******************************************************************
*º¯ÊýÃû³Æ:
*¹¦ÄÜÃèÊö:
*ÊäÈë²ÎÊý:
*Êä³ö²ÎÊý:
*·µ»ØÖµ:
*ÆäËüËµÃ÷:
*ÐÞ¸ÄÈÕÆÚ    °æ±¾ºÅ   ÐÞ¸ÄÈË    ÐÞ¸ÄÄÚÈÝ
*---------------------------------------------------
*2017/9/4                              we004 we014
******************************************************************/
uint8_t ucWriteBufftemp[64] = {0};
uint8_t STM320TempIAPWrite(uint32_t uiWriteAddr, uint8_t *pucWriteBuff, uint16_t usWriteLength)
{
    uint8_t i = 0;
    uint32_t *puiWriteData = NULL;
    FLASH_Status status = FLASH_COMPLETE;
    uint8_t *pucbuffer = ucWriteBufftemp;

    memcpy(ucWriteBufftemp,pucWriteBuff,sizeof(ucWriteBufftemp));    
    puiWriteData = (uint32_t *)pucbuffer;
    
    asm ("CPSID   I");

    FLASH_Unlock();
    for (i=0;i<16;i++)
    {
        status = FLASH_ProgramWord(uiWriteAddr, *puiWriteData);
        if (status != FLASH_COMPLETE)
        {
            return 1;
        }
        uiWriteAddr = uiWriteAddr + 4;
        puiWriteData = puiWriteData + 1;
    }
    FLASH_Lock();
    /* ´ò¿ªÖÐ¶Ï */
    asm ("CPSIE   I");

    return 0;
}

/*±¸×¢:USART2ÔÝ²»Ê¹ÓÃ*/

void swapEndian(uint8_t *array, int length) 
{
    uint8_t temp = 0;
  
    // È·±£Êý×é³¤¶ÈÖÁÉÙÎª2£¬²¢ÇÒÎªÅ¼Êý
    if (length < 2 || length % 2 != 0) {
        return;
    }

    for (int i = 0; i < length; i += 2) 
    {
        // ½»»»Î»ÖÃ i ºÍ i + 1 µÄÔªËØ
        temp = array[i];
        array[i] = array[i + 1];
        array[i + 1] = temp;
    }
}
